## Plan Result (sbox_landing)




<pre><code>Plan: 0 to add, 55 to change, 0 to destroy.</code></pre>

* Update
  * azurerm_container_group.runner[&#34;00dlrm-ingestionengine&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_eventhub_namespace.this
  * module.data_landing_zone[&#34;00&#34;].azurerm_log_analytics_workspace.this
  * module.data_landing_zone[&#34;00&#34;].azurerm_public_ip.legacy_pip[&#34;legacy-sql&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_synapse_workspace.this
  * module.logic[&#34;00&#34;].azurerm_logic_app_standard.this
  * module.logic[&#34;00&#34;].azurerm_private_endpoint.this
  * module.logic[&#34;00&#34;].azurerm_resource_group_template_deployment.sqlConn
  * module.logic[&#34;00&#34;].azurerm_service_plan.this
  * module.logic[&#34;00&#34;].azurerm_storage_account.this
  * module.data_landing_zone[&#34;00&#34;].module.legacy_database[&#34;legacy-sql&#34;].azurerm_network_interface.vm_nic
  * module.data_landing_zone[&#34;00&#34;].module.legacy_database[&#34;legacy-sql&#34;].azurerm_windows_virtual_machine.winvm[0]
  * module.data_landing_zone[&#34;00&#34;].module.logging_vault.azurerm_key_vault.kv
  * module.data_landing_zone[&#34;00&#34;].module.logging_vault_pe.azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_private_endpoint.metadata_mssql_pe[0]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mysql.azurerm_mysql_flexible_server.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault_pe[&#34;meta001&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault_pe[&#34;meta002&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_group.this[&#34;nsg&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_route_table.this[&#34;rt&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_virtual_network.this[&#34;vnet&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_eventhub_pe.azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.shared_product_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone[&#34;00&#34;].module.shir001.azurerm_lb.shir_lb
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;curated-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;curated-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;external-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;external-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;landing-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;landing-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;raw-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;raw-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;workspace-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;workspace-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.synapse_pe[&#34;dev&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.synapse_pe[&#34;sql&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.synapse_pe[&#34;sqlOnDemand&#34;].azurerm_private_endpoint.this
  * module.logic[&#34;00&#34;].module.application_insights.azurerm_application_insights.this
  * module.data_landing_zone[&#34;00&#34;].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_container_group.runner["00dlrm-ingestionengine"] will be updated in-place
  ~ resource "azurerm_container_group" "runner" {
        id                          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.ContainerInstance/containerGroups/ingest00-runner-sbox"
        name                        = "ingest00-runner-sbox"
      ~ tags                        = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].azurerm_eventhub_namespace.this will be updated in-place
  ~ resource "azurerm_eventhub_namespace" "this" {
        id                                        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-sbox"
        name                                      = "ingest00-integration-eventHubNamespace001-sbox"
      ~ tags                                      = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].azurerm_log_analytics_workspace.this will be updated in-place
  ~ resource "azurerm_log_analytics_workspace" "this" {
        id                                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.OperationalInsights/workspaces/ingest00-logAnalytics001-sbox"
        name                                    = "ingest00-logAnalytics001-sbox"
      ~ tags                                    = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (15 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_public_ip.legacy_pip["legacy-sql"] will be updated in-place
  ~ resource "azurerm_public_ip" "legacy_pip" {
        id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/publicIPAddresses/ingest00-legacy-sql-pip-sbox"
        name                    = "ingest00-legacy-sql-pip-sbox"
      ~ tags                    = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (12 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_synapse_workspace.this will be updated in-place
  ~ resource "azurerm_synapse_workspace" "this" {
        id                                   = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Synapse/workspaces/ingest00-product-synapse001-sbox"
        name                                 = "ingest00-product-synapse001-sbox"
      ~ tags                                 = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.logic["00"].azurerm_logic_app_standard.this will be updated in-place
  ~ resource "azurerm_logic_app_standard" "this" {
        id                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox/providers/Microsoft.Web/sites/ingest00-logic-sbox"
        name                           = "ingest00-logic-sbox"
      ~ tags                           = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.logic["00"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox/providers/Microsoft.Network/privateEndpoints/ingest00logicsbox-pe"
        name                          = "ingest00logicsbox-pe"
      ~ tags                          = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.logic["00"].azurerm_resource_group_template_deployment.sqlConn will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "sqlConn" {
        id                       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox/providers/Microsoft.Resources/deployments/logicapp-sql-conn-deployment"
        name                     = "logicapp-sql-conn-deployment"
      ~ output_content           = jsonencode({}) -> (known after apply)
      ~ parameters_content       = jsonencode(
          ~ {
              - location   = {
                  - value = "uksouth"
                }
                # (1 unchanged attribute hidden)
            }
        )
        tags                     = {}
        # (5 unchanged attributes hidden)
    }

  # module.logic["00"].azurerm_service_plan.this will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                           = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox/providers/Microsoft.Web/serverFarms/ingest00-app-service-plan-sbox"
        name                         = "ingest00-app-service-plan-sbox"
      ~ tags                         = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (11 unchanged attributes hidden)
    }

  # module.logic["00"].azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox/providers/Microsoft.Storage/storageAccounts/ingest00logicsbox"
        name                              = "ingest00logicsbox"
      ~ tags                              = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (63 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.legacy_database["legacy-sql"].azurerm_network_interface.vm_nic will be updated in-place
  ~ resource "azurerm_network_interface" "vm_nic" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/networkInterfaces/ingest00-legacy-sql-nic-sbox"
        name                          = "ingest00-legacy-sql-nic-sbox"
      ~ tags                          = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.legacy_database["legacy-sql"].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = false -> true
        id                                                     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Compute/virtualMachines/ingest00-legacy-sql-sbox"
        name                                                   = "ingest00-legacy-sql-sbox"
      ~ tags                                                   = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (41 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.logging_vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.KeyVault/vaults/ingest00-logging-sbox"
        name                            = "ingest00-logging-sbox"
      ~ tags                            = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.logging_vault_pe.azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-keyVault001-pe-sbox"
        name                          = "ingest00-keyVault001-pe-sbox"
      ~ tags                          = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.data.azuread_group.admin_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "admin_group" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Owners (sub:dts-dataingest-sbox)"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.azurerm_mssql_database.this["MetadataControl"] will be updated in-place
  ~ resource "azurerm_mssql_database" "this" {
        id                                                         = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-sbox/databases/MetadataControl"
        name                                                       = "MetadataControl"
      ~ tags                                                       = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.azurerm_mssql_server.this will be updated in-place
  ~ resource "azurerm_mssql_server" "this" {
        id                                           = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Sql/servers/ingest00-metadata-mssql-sbox"
        name                                         = "ingest00-metadata-mssql-sbox"
      ~ tags                                         = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (13 unchanged attributes hidden)

      ~ azuread_administrator {
          ~ object_id                   = "35996ac2-2097-4f8f-b271-313f29c43141" -> (known after apply)
          ~ tenant_id                   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].module.metadata_mssql.azurerm_private_endpoint.metadata_mssql_pe[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "metadata_mssql_pe" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-metadata-mssql-pe-sbox"
        name                          = "ingest00-metadata-mssql-pe-sbox"
      ~ tags                          = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sand

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["raw"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00rawsbox"
        name                              = "ingest00rawsbox"
      ~ tags                              = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (63 unchanged attributes hidden)

      ~ network_rules {
            # (4 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Security/datascanners/StorageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00workspacesbox"
        name                              = "ingest00workspacesbox"
      ~ tags                              = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (63 unchanged attributes hidden)

      ~ network_rules {
            # (4 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/providers/Microsoft.Security/datascanners/StorageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["curated-blob"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-curated-blob-pe-sbox"
        name                          = "ingest00-curated-blob-pe-sbox"
      ~ tags                          = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["curated-dfs"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-curated-dfs-pe-sbox"
        name                          = "ingest00-curated-dfs-pe-sbox"
      ~ tags                          = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["external-blob"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-external-blob-pe-sbox"
        name                          = "ingest00-external-blob-pe-sbox"
      ~ tags                          = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["external-dfs"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-external-dfs-pe-sbox"
        name                          = "ingest00-external-dfs-pe-sbox"
      ~ tags                          = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["landing-blob"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-landing-blob-pe-sbox"
        name                          = "ingest00-landing-blob-pe-sbox"
      ~ tags                          = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["landing-dfs"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-landing-dfs-pe-sbox"
        name                          = "ingest00-landing-dfs-pe-sbox"
      ~ tags                          = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["raw-blob"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-raw-blob-pe-sbox"
        name                          = "ingest00-raw-blob-pe-sbox"
      ~ tags                          = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["raw-dfs"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-raw-dfs-pe-sbox"
        name                          = "ingest00-raw-dfs-pe-sbox"
      ~ tags                          = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["workspace-blob"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-workspace-blob-pe-sbox"
        name                          = "ingest00-workspace-blob-pe-sbox"
      ~ tags                          = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage_pe["workspace-dfs"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-workspace-dfs-pe-sbox"
        name                          = "ingest00-workspace-dfs-pe-sbox"
      ~ tags                          = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.synapse_pe["dev"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-dev-pe-sbox"
        name                          = "ingest00-product-synapse001-dev-pe-sbox"
      ~ tags                          = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.synapse_pe["sql"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-sql-pe-sbox"
        name                          = "ingest00-product-synapse001-sql-pe-sbox"
      ~ tags                          = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.synapse_pe["sqlOnDemand"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Network/privateEndpoints/ingest00-product-synapse001-sqlOnDemand-pe-sbox"
        name                          = "ingest00-product-synapse001-sqlOnDemand-pe-sbox"
      ~ tags                          = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.logic["00"].module.application_insights.azurerm_application_insights.this will be updated in-place
  ~ resource "azurerm_application_insights" "this" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox/providers/Microsoft.Insights/components/data-landing-sbox"
        name                                  = "data-landing-sbox"
      ~ tags                                  = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (16 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine_scale_set" "windows_scale_set" {
        id                                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Compute/virtualMachineScaleSets/ingest00-shir001-vmss-sbox"
        name                                              = "ingest00-shir001-vmss-sbox"
      ~ tags                                              = {
          + "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
        # (34 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

Plan: 0 to add, 55 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":42,"Program":"tfcmt","SHA1":"","Target":"sbox_landing","Vars":{}} -->